; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v8 - type_1 ?v2 - type_2)
 	      (pred_4 ?v7 - object ?v2 - type_2)
	      (pred_1 ?v8 - type_1 ?v6 - type_3)
	      (pred_2 ?v8 - type_1 ?v7 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v8 - type_1 ?v4 ?v5 - type_2)
       :precondition (and  (pred_3 ?v8 ?v4))
       :effect (and  (pred_3 ?v8 ?v5)
		     (not (pred_3 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_1 ?v1 - object ?v3 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v3) (pred_3 ?v8 ?v3) (pred_1 ?v8 ?v6))
       :effect (and (pred_2 ?v8 ?v1 ?v6)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_1 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_1 ?v1 - object ?v3 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v1 ?v6) (pred_3 ?v8 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_1 ?v8 ?v6)
		    (not (pred_2 ?v8 ?v1 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_07 obj_10 - type_3
obj_09 obj_05 obj_03 obj_01 - type_2
obj_02 obj_06 obj_04 - object)
(:init
(pred_3 obj_08 obj_01)
(pred_1 obj_08 obj_07)
(pred_1 obj_08 obj_10)
(pred_4 obj_02 obj_09)
(pred_4 obj_06 obj_01)
(pred_4 obj_04 obj_09)
)
(:goal
(and
(pred_4 obj_02 obj_01)
(pred_4 obj_06 obj_03)
(pred_4 obj_04 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_08 ?b obj_10))))
)
)

; plan
1. (op_3 obj_08 obj_06 obj_01 obj_07)
   deleted: (pred_4 obj_06 obj_01) (pred_1 obj_08 obj_07)
   added: (pred_2 obj_08 obj_06 obj_07)
   goals met: 1 of 3
2. (op_1 obj_08 obj_01 obj_03)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_03)
   goals met: 1 of 3
3. (op_2 obj_08 obj_06 obj_03 obj_07)
   deleted: (pred_2 obj_08 obj_06 obj_07)
   added: (pred_4 obj_06 obj_03) (pred_1 obj_08 obj_07)
   goals met: 2 of 3
4. (op_1 obj_08 obj_03 obj_09)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_09)
   goals met: 2 of 3
5. (op_3 obj_08 obj_02 obj_09 obj_07)
   deleted: (pred_4 obj_02 obj_09) (pred_1 obj_08 obj_07)
   added: (pred_2 obj_08 obj_02 obj_07)
   goals met: 2 of 3
6. (op_1 obj_08 obj_09 obj_01)
   deleted: (pred_3 obj_08 obj_09)
   added: (pred_3 obj_08 obj_01)
   goals met: 2 of 3
7. (op_2 obj_08 obj_02 obj_01 obj_07)
   deleted: (pred_2 obj_08 obj_02 obj_07)
   added: (pred_4 obj_02 obj_01) (pred_1 obj_08 obj_07)
   goals met: 3 of 3
